In [1]:
#Lab Session 14
#Name: Anant Dubey
#PRN: 1132220920

In [2]:
#Link 1
# Allow several prints in one cell
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

import pandas as pd

In [3]:
# Input
#Q1) How to create a series from a list, numpy array and dict?

import numpy as np
a_list = list("abcdefg")
numpy_array = np.arange(1, 10)
dictionary = {"A":  0, "B":1, "C":2, "D":3, "E":5}

In [4]:
series1 = pd.Series(a_list)
print(series1)
series2 = pd.Series(numpy_array)
print(series2)
series3 = pd.Series(dictionary)
print(series3)

0    a
1    b
2    c
3    d
4    e
5    f
6    g
dtype: object
0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
dtype: int32
A    0
B    1
C    2
D    3
E    5
dtype: int64

In [5]:
#Q2)How to combine many series to form a dataframe?

# input
ser1 = pd.Series(list('abcedfghijklmnopqrstuvwxyz'))
ser2 = pd.Series(np.arange(26))
# using pandas DataFrame
ser_df = pd.DataFrame(ser1, ser2).reset_index()
ser_df.head()
# using pandas DataFrame with a dictionary, gives a specific name to the column
ser_df = pd.DataFrame({"col1":ser1, "col2":ser2})
ser_df.head(5)
# using pandas concat
ser_df = pd.concat([ser1, ser2], axis = 1)
ser_df.head()

   index  0
0      0  a
1      1  b
2      2  c
3      3  e
4      4  d

  col1  col2
0    a     0
1    b     1
2    c     2
3    e     3
4    d     4

   0  1
0  a  0
1  b  1
2  c  2
3  e  3
4  d  4

In [6]:
#Q3) How to get the items of series A not present in series B?

# input
ser1 = pd.Series([1, 2, 3, 4, 5])
ser2 = pd.Series([4, 5, 6, 7, 8])
ser1[~ser1.isin(ser2)]

0    1
1    2
2    3
dtype: int64

In [7]:
#Q4) How to get the items not common to both series A and series B?

# input
ser1 = pd.Series([1, 2, 3, 4, 5])
ser2 = pd.Series([4, 5, 6, 7, 8])
# using pandas
a_not_b = ser1[~ser1.isin(ser2)]
b_not_a = ser2[~ser2.isin(ser1)]
                          
a_not_b.append(b_not_a, ignore_index = True)

# using numpy union and intersection
ser_u = pd.Series(np.union1d(ser1, ser2))
ser_i = pd.Series(np.intersect1d(ser1, ser2))
ser_u[~ser_u.isin(ser_i)]

C:\Users\anant\AppData\Local\Temp\ipykernel_13612\3856513370.py:10: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  a_not_b.append(b_not_a, ignore_index = True)

0    1
1    2
2    3
3    6
4    7
5    8
dtype: int64

0    1
1    2
2    3
5    6
6    7
7    8
dtype: int64

In [8]:
#Q5) How to get useful infos

# input
state = np.random.RandomState(100)
ser = pd.Series(state.normal(10, 5, 25))
# using pandas
ser.describe()

count    25.000000
mean     10.435437
std       4.253118
min       1.251173
25%       7.709865
50%      10.922593
75%      13.363604
max      18.094908
dtype: float64

In [9]:
#Q6) How to get frequency counts of unique items of a series?

# input
ser = pd.Series(np.take(list('abcdefgh'), np.random.randint(8, size=30)))
ser.value_counts()

a    6
d    6
f    5
h    4
e    3
c    3
g    2
b    1
dtype: int64

In [10]:
#Q7) How to convert a numpy array to a dataframe of given shape? (L1)

# input
ser = pd.Series(np.random.randint(1, 10, 35))
ser

0     8
1     7
2     3
3     9
4     6
5     5
6     2
7     1
8     2
9     9
10    7
11    6
12    7
13    4
14    1
15    8
16    4
17    6
18    7
19    9
20    1
21    8
22    4
23    6
24    4
25    5
26    6
27    7
28    5
29    1
30    3
31    1
32    8
33    4
34    2
dtype: int32

In [11]:
# using numpy
pd.DataFrame(np.array(ser).reshape(7, 5))

# using only pandas
pd.DataFrame(ser.values.reshape(7, 5))

   0  1  2  3  4
0  8  7  3  9  6
1  5  2  1  2  9
2  7  6  7  4  1
3  8  4  6  7  9
4  1  8  4  6  4
5  5  6  7  5  1
6  3  1  8  4  2

   0  1  2  3  4
0  8  7  3  9  6
1  5  2  1  2  9
2  7  6  7  4  1
3  8  4  6  7  9
4  1  8  4  6  4
5  5  6  7  5  1
6  3  1  8  4  2

In [12]:
#Q8)  How to find the positions of numbers that are multiples of 3 from a series?

# input

np.random.RandomState(100)
ser = pd.Series(np.random.randint(1, 5, 10))
ser

RandomState(MT19937) at 0x15C762CD440

0    3
1    3
2    2
3    1
4    3
5    1
6    1
7    4
8    1
9    4
dtype: int32

In [13]:
# using the where clause
ser.where(lambda x: x%3 == 0).dropna()

# using numpy and reshape to get a pandas series
#pd.Series(np.argwhere(ser%3 == 0).reshape(4))
np.argwhere(ser%3 == 0)

0    3.0
1    3.0
4    3.0
dtype: float64

ValueError: Length of values (1) does not match length of index (10)

In [14]:
#Q9) How to extract items at given positions from a series

# input

ser = pd.Series(list('abcdefghijklmnopqrstuvwxyz'))
pos = [0, 4, 8, 14, 20]
# using loc
ser.loc[pos]

# using series take
ser.take(pos)

0     a
4     e
8     i
14    o
20    u
dtype: object

0     a
4     e
8     i
14    o
20    u
dtype: object

In [15]:
#Q10)  How to stack two series vertically and horizontally ?

# input
ser1 = pd.Series(range(5))
ser2 = pd.Series(list('abcde'))
# vertical
ser1.append(ser2)
# or using pandas concat and axis = 0
pd.concat([ser1, ser2], axis = 0)

# horizontal
pd.concat([ser1, ser2], axis = 1)

C:\Users\anant\AppData\Local\Temp\ipykernel_13612\2131778299.py:7: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  ser1.append(ser2)

0    0
1    1
2    2
3    3
4    4
0    a
1    b
2    c
3    d
4    e
dtype: object

0    0
1    1
2    2
3    3
4    4
0    a
1    b
2    c
3    d
4    e
dtype: object

   0  1
0  0  a
1  1  b
2  2  c
3  3  d
4  4  e

In [16]:
#Q11) How to get the positions of items of series A in another series B?

# input
ser1 = pd.Series([10, 9, 6, 5, 3, 1, 12, 8, 13])
ser2 = pd.Series([1, 3, 10, 13])
# get's the index, but it's sorts the index
list(ser1[ser1.isin(ser2)].index)

# using numpy where
[np.where(i == ser1)[0].tolist()[0] for i in ser2]

# using pandas Index and get location
[pd.Index(ser1).get_loc(i) for i in ser2]

[0, 4, 5, 8]

[5, 4, 0, 8]

[5, 4, 0, 8]

In [17]:
#Q12) How to compute difference of differences between consequtive numbers of a series?

# input
ser = pd.Series([1, 3, 6, 10, 15, 21, 27, 35])

# Desired Output
# [nan, 2.0, 3.0, 4.0, 5.0, 6.0, 6.0, 8.0]
# [nan, nan, 1.0, 1.0, 1.0, 1.0, 0.0, 2.0]
# using pandas diff()
ser.diff(periods = 1).tolist()
ser.diff(periods = 1).diff(periods = 1).tolist()

[nan, 2.0, 3.0, 4.0, 5.0, 6.0, 6.0, 8.0]

[nan, nan, 1.0, 1.0, 1.0, 1.0, 0.0, 2.0]

In [18]:
#Q13) How to convert a series of date-strings to a timeseries?

# input
ser = pd.Series(['01 Jan 2010', '02-02-2011', '20120303', '2013/04/04', '2014-05-05', '2015-06-06T12:20'])


'''
Desired Output

0   2010-01-01 00:00:00
1   2011-02-02 00:00:00
2   2012-03-03 00:00:00
3   2013-04-04 00:00:00
4   2014-05-05 00:00:00
5   2015-06-06 12:20:00
'''

'\nDesired Output\n\n0   2010-01-01 00:00:00\n1   2011-02-02 00:00:00\n2   2012-03-03 00:00:00\n3   2013-04-04 00:00:00\n4   2014-05-05 00:00:00\n5   2015-06-06 12:20:00\n'

In [19]:
# using pands to_datetime
pd.to_datetime(ser)

# using dateutil parse
from dateutil.parser import parse
ser.map(lambda x: parse(x))

0   2010-01-01 00:00:00
1   2011-02-02 00:00:00
2   2012-03-03 00:00:00
3   2013-04-04 00:00:00
4   2014-05-05 00:00:00
5   2015-06-06 12:20:00
dtype: datetime64[ns]

0   2010-01-01 00:00:00
1   2011-02-02 00:00:00
2   2012-03-03 00:00:00
3   2013-04-04 00:00:00
4   2014-05-05 00:00:00
5   2015-06-06 12:20:00
dtype: datetime64[ns]

In [20]:
#Q14) How to filter words that contain atleast 2 vowels from a series?

# input
ser = pd.Series(['Apple', 'Orange', 'Plan', 'Python', 'Money'])

'''
Desired Output


0     Apple
1    Orange
4     Money
dtype: object
'''

# using nested loops
vowels = list("aeiou")
list_ = []
for w in ser:
    c = 0
    for l in list(w.lower()):
        if l in vowels:
            c += 1
    if c >= 2:
        print(w)
        list_.append(w)

ser[ser.isin(list_)]

# another solution using counter

from collections import Counter
mask = ser.map(lambda x: sum([Counter(x.lower()).get(i, 0) for i in list('aeiou')]) >= 2)
ser[mask]

'\nDesired Output\n\n\n0     Apple\n1    Orange\n4     Money\ndtype: object\n'

Apple
Orange
Money

0     Apple
1    Orange
4     Money
dtype: object

0     Apple
1    Orange
4     Money
dtype: object

In [21]:
#Q15) How to replace missing spaces in a string with the least frequent character?

# input
my_str = 'dbc deb abed ggade'

'''
Desired Output

'dbccdebcabedcggade'  # least frequent is 'c'
'''

# using Counter
from collections import Counter
my_str_ = my_str
Counter_ = Counter(list(my_str_.replace(" ", "")))
Counter_
minimum = min(Counter_, key = Counter_.get)

print(my_str.replace(" ", minimum))

# using pandas
ser = pd.Series(list(my_str.replace(" ", "")))
ser.value_counts()
minimum = list(ser.value_counts().index)[-1]
minimum
print(my_str.replace(" ", minimum))

"\nDesired Output\n\n'dbccdebcabedcggade'  # least frequent is 'c'\n"

Counter({'d': 4, 'b': 3, 'c': 1, 'e': 3, 'a': 2, 'g': 2})

dbccdebcabedcggade

d    4
b    3
e    3
a    2
g    2
c    1
dtype: int64

'c'

dbccdebcabedcggade

In [22]:
#Q16) How to change column values when importing csv to a dataframe?

# input
import os
for dirname, _, filenames in os.walk('/kaggle/input'):
    for filename in filenames:
        print(os.path.join(dirname, filename))

# first let's import using the previuos code and save as a normal csv

names = ['CRIM', 'ZN', 'INDUS', 'CHAS', 'NOX', 'RM', 'AGE', 'DIS', 'RAD', 'TAX', 'PTRATIO', 'B', 'LSTAT', 'MEDV']
with open("housing.csv") as f:
    data = f.read()
    nth_rows = []
    for i, rows in enumerate(data.split("\n")):
        nth_rows.append(rows)

data_ = [nth_rows[i].split() for i in range(len(nth_rows))]

df = pd.DataFrame(data_, columns=names)
df.head()
df.to_csv("housing_preprocessed.csv")
del df

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
0,0.00632,18.00,2.310,0,0.5380,6.5750,65.20,4.0900,1,296.0,15.30,396.90,4.98,24.00
1,0.02731,0.00,7.070,0,0.4690,6.4210,78.90,4.9671,2,242.0,17.80,396.90,9.14,21.60
2,0.02729,0.00,7.070,0,0.4690,7.1850,61.10,4.9671,2,242.0,17.80,392.83,4.03,34.70
3,0.03237,0.00,2.180,0,0.4580,6.9980,45.80,6.0622,3,222.0,18.70,394.63,2.94,33.40
4,0.06905,0.00,2.180,0,0.4580,7.1470,54.20,6.0622,3,222.0,18.70,396.90,5.33,36.20

In [23]:
# now let's start importing as normal and use converters to convert the values
# skipfooter because we had the last rows with nan values and index_col to specify that the first column is the index
df = pd.read_csv("housing_preprocessed.csv",  index_col = 0, skipfooter=1,  converters = {"MEDV": lambda x: "HIGH" if float(x) >= 25 else "LOW"})
df

C:\Users\anant\AppData\Local\Temp\ipykernel_13612\511090984.py:3: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support skipfooter; you can avoid this warning by specifying engine='python'.
  df = pd.read_csv("housing_preprocessed.csv",  index_col = 0, skipfooter=1,  converters = {"MEDV": lambda x: "HIGH" if float(x) >= 25 else "LOW"})

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
0,0.00632,18.0,2.31,0,0.538,6.575,65.2,4.0900,1,296.0,15.3,396.90,4.98,LOW
1,0.02731,0.0,7.07,0,0.469,6.421,78.9,4.9671,2,242.0,17.8,396.90,9.14,LOW
2,0.02729,0.0,7.07,0,0.469,7.185,61.1,4.9671,2,242.0,17.8,392.83,4.03,HIGH
3,0.03237,0.0,2.18,0,0.458,6.998,45.8,6.0622,3,222.0,18.7,394.63,2.94,HIGH
4,0.06905,0.0,2.18,0,0.458,7.147,54.2,6.0622,3,222.0,18.7,396.90,5.33,HIGH
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
501,0.06263,0.0,11.93,0,0.573,6.593,69.1,2.4786,1,273.0,21.0,391.99,9.67,LOW
502,0.04527,0.0,11.93,0,0.573,6.120,76.7,2.2875,1,273.0,21.0,396.90,9.08,LOW
503,0.06076,0.0,11.93,0,0.573,6.976,91.0,2.1675,1,273.0,21.0,396.90,5.64,LOW
504,0.10959,0.0,11.93,0,0.573,6.794,89.3,2.3889,1,273.0,21.0,393.45,6.48,LOW
505,0.04741,0.0,11.93,0,0.573,6.030,80.8,2.5050,1,273.0,21.0,396.90,7.88,LOW

In [24]:
#Q17) How to import only specified columns from a csv file?

# input
        
# code that generates the housing_preprocessed.csv file
names = ['CRIM', 'ZN', 'INDUS', 'CHAS', 'NOX', 'RM', 'AGE', 'DIS', 'RAD', 'TAX', 'PTRATIO', 'B', 'LSTAT', 'MEDV']
with open("housing.csv") as f:
    data = f.read()
    nth_rows = []
    for i, rows in enumerate(data.split("\n")):
        nth_rows.append(rows)

data_ = [nth_rows[i].split() for i in range(len(nth_rows))]

df = pd.DataFrame(data_, columns=names)
df.to_csv("housing_preprocessed.csv")
del df

# use the /kaggle/input/boston-house-prices/housing_preprocessed.csv file
import os
for dirname, _, filenames in os.walk('/kaggle/input'):
    for filename in filenames:
        print(os.path.join(dirname, filename))

file = "housing_preprocessed.csv"
# using index
df = pd.read_csv(file, usecols = [1, 2, 4], skipfooter=1)
df.head()
# using column names
df = pd.read_csv(file, usecols = ["CRIM", "ZN", "CHAS"])
df.head()

C:\Users\anant\AppData\Local\Temp\ipykernel_13612\3351602391.py:27: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support skipfooter; you can avoid this warning by specifying engine='python'.
  df = pd.read_csv(file, usecols = [1, 2, 4], skipfooter=1)

      CRIM    ZN  CHAS
0  0.00632  18.0     0
1  0.02731   0.0     0
2  0.02729   0.0     0
3  0.03237   0.0     0
4  0.06905   0.0     0

      CRIM    ZN  CHAS
0  0.00632  18.0   0.0
1  0.02731   0.0   0.0
2  0.02729   0.0   0.0
3  0.03237   0.0   0.0
4  0.06905   0.0   0.0

In [25]:
#Q18) How to check if a dataframe has any missing values?

# input
df = pd.read_csv("Cars93.csv")
df

,Unnamed: 0,Manufacturer,Model,Type,Min.Price,Price,Max.Price,MPG.city,MPG.highway,AirBags,...,Passengers,Length,Wheelbase,Width,Turn.circle,Rear.seat.room,Luggage.room,Weight,Origin,Make
0,1,Acura,Integra,Small,12.9,15.9,18.8,25,31,None,...,5,177,102,68,37,26.5,11.0,2705,non-USA,Acura Integra
1,2,Acura,Legend,Midsize,29.2,33.9,38.7,18,25,Driver & Passenger,...,5,195,115,71,38,30.0,15.0,3560,non-USA,Acura Legend
2,3,Audi,90,Compact,25.9,29.1,32.3,20,26,Driver only,...,5,180,102,67,37,28.0,14.0,3375,non-USA,Audi 90
3,4,Audi,100,Midsize,30.8,37.7,44.6,19,26,Driver & Passenger,...,6,193,106,70,37,31.0,17.0,3405,non-USA,Audi 100
4,5,BMW,535i,Midsize,23.7,30.0,36.2,22,30,Driver only,...,4,186,109,69,39,27.0,13.0,3640,non-USA,BMW 535i
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
88,89,Volkswagen,Eurovan,Van,16.6,19.7,22.7,17,21,None,...,7,187,115,72,38,34.0,NaN,3960,non-USA,Volkswagen Eurovan
89,90,Volkswagen,Passat,Compact,17.6,20.0,22.4,21,30,None,...,5,180,103,67,35,31.5,14.0,2985,non-USA,Volkswagen Passat
90,91,Volkswagen,Corrado,Sporty,22.9,23.3,23.7,18,25,None,...,4,159,97,66,36,26.0,15.0,2810,non-USA,Volkswagen Corrado
91,92,Volvo,240,Compact,21.8,22.7,23.5,21,28,Driver only,...,5,190,104,67,37,29.5,14.0,2985,non-USA,Volvo 240
92,93,Volvo,850,Midsize,24.8,26.7,28.5,20,28,Driver & Passenger,...,5,184,105,69,38,30.0,15.0,3245,non-USA,Volvo 850

In [26]:
# Solution 1
print("Our df has a total of {} null values".format(df.isnull().sum().sum()))
print()

# Solution 2
df.isnull().values.any()
print()

# Solution 3
# A more detailed one
def report_nulls(df):
    '''
    Show a fast report of the DF.
    '''
    rows = df.shape[0]
    columns = df.shape[1]
    null_cols = 0
    list_of_nulls_cols = []
    for col in list(df.columns):
        null_values_rows = df[col].isnull().sum()
        null_rows_pcn = round(((null_values_rows)/rows)*100, 2)
        col_type = df[col].dtype
        if null_values_rows > 0:
            print("The column {} has {} null values. It is {}% of total rows.".format(col, null_values_rows, null_rows_pcn))
            print("The column {} is of type {}.\n".format(col, col_type))
            null_cols += 1
            list_of_nulls_cols.append(col)
    null_cols_pcn = round((null_cols/columns)*100, 2)
    print("The DataFrame has {} columns with null values. It is {}% of total columns.".format(null_cols, null_cols_pcn))
    return list_of_nulls_cols

report_nulls(df)

Our df has a total of 13 null values

True

The column Rear.seat.room has 2 null values. It is 2.15% of total rows.
The column Rear.seat.room is of type float64.

The column Luggage.room has 11 null values. It is 11.83% of total rows.
The column Luggage.room is of type float64.

The DataFrame has 2 columns with null values. It is 7.14% of total columns.

['Rear.seat.room', 'Luggage.room']

In [27]:
#Q19) How to replace missing values of multiple numeric columns with the mean?

# input
df = pd.read_csv("Cars93.csv")
# Solution 1
beg_null = df.isnull().sum().sum()
print(beg_null)
# notice that we have filtering the columns  as a list.
df[["Luggage.room"]] = df[["Luggage.room"]].apply(lambda x: x.fillna(x.mean()))
end_null = df.isnull().sum().sum()
print(end_null)

print("We have got rid of {} null values, filling them with the mean.".format(beg_null - end_null))

13
2
We have got rid of 11 null values, filling them with the mean.

In [28]:
#Q20)  How to change the order of columns of a dataframe?

# input
df = pd.DataFrame(np.arange(20).reshape(-1, 5), columns=list('abcde'))
# Solution to question 1
# we pass a list with the custom names BUT THIS DOESN'T change in place
df = pd.DataFrame(np.arange(20).reshape(-1, 5), columns=list('abcde'))
df[["c", "b", "a", "d", "e"]]
df

# if we reasing that this will work
df = df[["c", "b", "a", "d", "e"]]
df

# Solution to question 2
def change_cols(df, col1, col2):
    df_columns = df.columns.to_list()
    index1 = df_columns.index(col1)
    index2 = df_columns.index(col2)
    # swaping values
    df_columns[index1], df_columns[index2] = col1, col2
    
    return df[df_columns]


df = change_cols(df, "b", "e")
df

    c   b   a   d   e
0   2   1   0   3   4
1   7   6   5   8   9
2  12  11  10  13  14
3  17  16  15  18  19

    a   b   c   d   e
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

    c   b   a   d   e
0   2   1   0   3   4
1   7   6   5   8   9
2  12  11  10  13  14
3  17  16  15  18  19

    c   b   a   d   e
0   2   1   0   3   4
1   7   6   5   8   9
2  12  11  10  13  14
3  17  16  15  18  19

In [29]:
# Solution to question 3
df = pd.DataFrame(np.arange(20).reshape(-1, 5), columns=list('abcde'))
col_list = list(df.columns)
col_list_reversed = col_list[::-1]
col_list
col_list_reversed
# using the trick from solution 1
df = df[col_list_reversed]
df


print("Solution from the website")
print("-------------------------")
# Others solution from the website

# Input
df = pd.DataFrame(np.arange(20).reshape(-1, 5), columns=list('abcde'))

# Solution Q1
df[list('cbade')]

# Solution Q2 - No hard coding
def switch_columns(df, col1=None, col2=None):
    colnames = df.columns.tolist()
    i1, i2 = colnames.index(col1), colnames.index(col2)
    colnames[i2], colnames[i1] = colnames[i1], colnames[i2]
    return df[colnames]

df1 = switch_columns(df, 'a', 'c')

# Solution Q3
df[sorted(df.columns)]
# or
df.sort_index(axis=1, ascending=False, inplace=True)

['a', 'b', 'c', 'd', 'e']

['e', 'd', 'c', 'b', 'a']

    e   d   c   b   a
0   4   3   2   1   0
1   9   8   7   6   5
2  14  13  12  11  10
3  19  18  17  16  15

Solution from the website
-------------------------

    c   b   a   d   e
0   2   1   0   3   4
1   7   6   5   8   9
2  12  11  10  13  14
3  17  16  15  18  19

    a   b   c   d   e
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [30]:
#Q21)  How to filter every nth row in a dataframe?

# input
df = pd.read_csv("Cars93.csv")
df

,Unnamed: 0,Manufacturer,Model,Type,Min.Price,Price,Max.Price,MPG.city,MPG.highway,AirBags,...,Passengers,Length,Wheelbase,Width,Turn.circle,Rear.seat.room,Luggage.room,Weight,Origin,Make
0,1,Acura,Integra,Small,12.9,15.9,18.8,25,31,None,...,5,177,102,68,37,26.5,11.0,2705,non-USA,Acura Integra
1,2,Acura,Legend,Midsize,29.2,33.9,38.7,18,25,Driver & Passenger,...,5,195,115,71,38,30.0,15.0,3560,non-USA,Acura Legend
2,3,Audi,90,Compact,25.9,29.1,32.3,20,26,Driver only,...,5,180,102,67,37,28.0,14.0,3375,non-USA,Audi 90
3,4,Audi,100,Midsize,30.8,37.7,44.6,19,26,Driver & Passenger,...,6,193,106,70,37,31.0,17.0,3405,non-USA,Audi 100
4,5,BMW,535i,Midsize,23.7,30.0,36.2,22,30,Driver only,...,4,186,109,69,39,27.0,13.0,3640,non-USA,BMW 535i
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
88,89,Volkswagen,Eurovan,Van,16.6,19.7,22.7,17,21,None,...,7,187,115,72,38,34.0,NaN,3960,non-USA,Volkswagen Eurovan
89,90,Volkswagen,Passat,Compact,17.6,20.0,22.4,21,30,None,...,5,180,103,67,35,31.5,14.0,2985,non-USA,Volkswagen Passat
90,91,Volkswagen,Corrado,Sporty,22.9,23.3,23.7,18,25,None,...,4,159,97,66,36,26.0,15.0,2810,non-USA,Volkswagen Corrado
91,92,Volvo,240,Compact,21.8,22.7,23.5,21,28,Driver only,...,5,190,104,67,37,29.5,14.0,2985,non-USA,Volvo 240
92,93,Volvo,850,Midsize,24.8,26.7,28.5,20,28,Driver & Passenger,...,5,184,105,69,38,30.0,15.0,3245,non-USA,Volvo 850

In [31]:
# First let's import only the columns we need
df = pd.read_csv("Cars93.csv", usecols=["Manufacturer", "Model", "Type"])

# Solution 1
# Using normal python slicing
df[::20]

df = pd.read_csv("Cars93.csv", usecols=["Manufacturer", "Model", "Type"])

# Solution 2
# Using iloc
df.iloc[::20, :][['Manufacturer', 'Model', 'Type']]

   Manufacturer    Model     Type
0         Acura  Integra    Small
20     Chrysler  LeBaron  Compact
40        Honda  Prelude   Sporty
60      Mercury   Cougar  Midsize
80       Subaru   Loyale    Small

   Manufacturer    Model     Type
0         Acura  Integra    Small
20     Chrysler  LeBaron  Compact
40        Honda  Prelude   Sporty
60      Mercury   Cougar  Midsize
80       Subaru   Loyale    Small

In [32]:
#Q22) How to get the last n rows of a dataframe with row sum > 100?

# input
df = pd.DataFrame(np.random.randint(10, 40, 60).reshape(-1, 4))
df1 = df.copy(deep = True)
# Solution 1
df["sum"] = df.sum(axis = 1)
df

print("The index of the rows that are greater than 100 are {}".format((df[df["sum"] > 100].index).to_list()[-2:]))

# Solution 2 using numpy
rowsums = df1.apply(np.sum, axis=1)

# last two rows with row sum greater than 100
last_two_rows = df1.iloc[np.where(rowsums > 100)[0][-2:], :]
last_two_rows

     0   1   2   3  sum
0   38  11  25  20   94
1   14  10  14  28   66
2   38  36  27  21  122
3   18  35  28  10   91
4   25  15  11  22   73
5   24  19  33  29  105
6   14  32  17  14   77
7   33  16  32  26  107
8   21  11  12  27   71
9   30  31  26  23  110
10  19  14  22  14   69
11  11  26  31  36  104
12  15  28  25  21   89
13  39  10  23  32  104
14  16  25  19  29   89

The index of the rows that are greater than 100 are [11, 13]

     0   1   2   3
11  11  26  31  36
13  39  10  23  32

In [33]:
#Q23) How to find and cap outliers from a series or dataframe column?

# input
ser = pd.Series(np.logspace(-2, 2, 30))
ser1 = ser.copy(deep = True)
ser2 = ser.copy(deep = True)
# Solution 1
# get the quantiles values
quantiles = np.quantile(ser, [0.05, 0.95])
ser

# filter ser using numpy to know where the values are below or greater than 5% or 95% and replace the values
ser.iloc[np.where(ser < quantiles[0])] = quantiles[0]
ser.iloc[np.where(ser > quantiles[1])] = quantiles[1]
    
# or we can just do
ser1[ser1 < quantiles[0]] = quantiles[0]
ser1[ser1 > quantiles[1]] = quantiles[1]

ser1

# Solution from the webpage
def cap_outliers(ser, low_perc, high_perc):
    low, high = ser.quantile([low_perc, high_perc])
    print(low_perc, '%ile: ', low, '|', high_perc, '%ile: ', high)
    ser[ser < low] = low
    ser[ser > high] = high
    return(ser)

capped_ser = cap_outliers(ser2, .05, .95)
ser2
capped_ser

0       0.010000
1       0.013738
2       0.018874
3       0.025929
4       0.035622
5       0.048939
6       0.067234
7       0.092367
8       0.126896
9       0.174333
10      0.239503
11      0.329034
12      0.452035
13      0.621017
14      0.853168
15      1.172102
16      1.610262
17      2.212216
18      3.039195
19      4.175319
20      5.736153
21      7.880463
22     10.826367
23     14.873521
24     20.433597
25     28.072162
26     38.566204
27     52.983169
28     72.789538
29    100.000000
dtype: float64

0      0.016049
1      0.016049
2      0.018874
3      0.025929
4      0.035622
5      0.048939
6      0.067234
7      0.092367
8      0.126896
9      0.174333
10     0.239503
11     0.329034
12     0.452035
13     0.621017
14     0.853168
15     1.172102
16     1.610262
17     2.212216
18     3.039195
19     4.175319
20     5.736153
21     7.880463
22    10.826367
23    14.873521
24    20.433597
25    28.072162
26    38.566204
27    52.983169
28    63.876672
29    63.876672
dtype: float64

0.05 %ile:  0.016049294076965887 | 0.95 %ile:  63.87667222018393

0      0.016049
1      0.016049
2      0.018874
3      0.025929
4      0.035622
5      0.048939
6      0.067234
7      0.092367
8      0.126896
9      0.174333
10     0.239503
11     0.329034
12     0.452035
13     0.621017
14     0.853168
15     1.172102
16     1.610262
17     2.212216
18     3.039195
19     4.175319
20     5.736153
21     7.880463
22    10.826367
23    14.873521
24    20.433597
25    28.072162
26    38.566204
27    52.983169
28    63.876672
29    63.876672
dtype: float64

0      0.016049
1      0.016049
2      0.018874
3      0.025929
4      0.035622
5      0.048939
6      0.067234
7      0.092367
8      0.126896
9      0.174333
10     0.239503
11     0.329034
12     0.452035
13     0.621017
14     0.853168
15     1.172102
16     1.610262
17     2.212216
18     3.039195
19     4.175319
20     5.736153
21     7.880463
22    10.826367
23    14.873521
24    20.433597
25    28.072162
26    38.566204
27    52.983169
28    63.876672
29    63.876672
dtype: float64

In [34]:
#Q24)  How to reverse the rows of a dataframe?

# input
df = pd.DataFrame(np.arange(25).reshape(5, -1))
# Solution 1
df
df.iloc[df.index.to_list()[::-1]]

# Solutions from the webpage
# Solution 2
df.iloc[::-1, :]

# Solution 3
print(df.loc[df.index[::-1], :])

    0   1   2   3   4
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19
4  20  21  22  23  24

    0   1   2   3   4
4  20  21  22  23  24
3  15  16  17  18  19
2  10  11  12  13  14
1   5   6   7   8   9
0   0   1   2   3   4

    0   1   2   3   4
4  20  21  22  23  24
3  15  16  17  18  19
2  10  11  12  13  14
1   5   6   7   8   9
0   0   1   2   3   4

    0   1   2   3   4
4  20  21  22  23  24
3  15  16  17  18  19
2  10  11  12  13  14
1   5   6   7   8   9
0   0   1   2   3   4

In [35]:
#Link 2
import pandas as pd
print(pd.__version__)

1.5.2

In [36]:
#list-to-Series Conversion
given_list = [2, 4, 5, 6, 9]

series = pd.Series(given_list)

print(series)

0    2
1    4
2    5
3    6
4    9
dtype: int64

In [37]:
#List-to-Series Conversion with Custom Indexing
given_list = [2, 4, 5, 6, 9]

series = pd.Series(given_list, index = [1, 3, 5, 7, 9])

print(series)

1    2
3    4
5    5
7    6
9    9
dtype: int64

In [38]:
#Date Series Generation
date_series = pd.date_range(start = '05-01-2021', end = '05-12-2021')

print(date_series)

DatetimeIndex(['2021-05-01', '2021-05-02', '2021-05-03', '2021-05-04',
               '2021-05-05', '2021-05-06', '2021-05-07', '2021-05-08',
               '2021-05-09', '2021-05-10', '2021-05-11', '2021-05-12'],
              dtype='datetime64[ns]', freq='D')

In [39]:
#Implementing a function on each and every element of a series
series = pd.Series([2, 4, 6, 8, 10])

print(series) # pandas series initially

print()

modified_series = series.apply(lambda x:x/2)

print(modified_series) # pandas series after function application

0     2
1     4
2     6
3     8
4    10
dtype: int64

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
dtype: float64

In [40]:
#Dictionary-to-Dataframe Conversion
dictionary = {'name': ['Vinay', 'Kushal', 'Aman'],
              'age' : [22, 25, 24],
              'occ' : ['engineer', 'doctor', 'accountant']}

dataframe = pd.DataFrame(dictionary)

print(dataframe)

     name  age         occ
0   Vinay   22    engineer
1  Kushal   25      doctor
2    Aman   24  accountant

In [41]:
#2D List-to-Dataframe Conversion
lists = [[2, 'Vishal', 22],
         [1, 'Kushal', 25],
         [1, 'Aman', 24]]

dataframe = pd.DataFrame(lists, columns = ['id', 'name', 'age'])

print(dataframe)

   id    name  age
0   2  Vishal   22
1   1  Kushal   25
2   1    Aman   24

In [42]:
#Reading CSV to Dataframe
dataframe = pd.read_csv('data.csv')

print(dataframe)

   id    name  age          occ  salary
0   1   Vinay   22    engineer    45000
1   2    Ajay   24      doctor    40000
2   3   Rohan   25  accountant    35000
3   4  Dhiraj   21      manager   52000
4   5     Ram   20      doctor    65000
5   6   Sumit   25    engineer    41000
6   7  Keshav   24    engineer    23000
7   8  Kartik   23     mechanic   45111
8   9   Aryan   23      manager   21000
9  10    Amar   22    engineer    35444

In [43]:
#Setting Custom Index in Dataframe
print(dataframe) # original dataframe before custom indexing

print()

dataframe_customindex = dataframe.set_index('id') # custom indexed dataframe with column, 'id'

print(dataframe_customindex)

   id    name  age          occ  salary
0   1   Vinay   22    engineer    45000
1   2    Ajay   24      doctor    40000
2   3   Rohan   25  accountant    35000
3   4  Dhiraj   21      manager   52000
4   5     Ram   20      doctor    65000
5   6   Sumit   25    engineer    41000
6   7  Keshav   24    engineer    23000
7   8  Kartik   23     mechanic   45111
8   9   Aryan   23      manager   21000
9  10    Amar   22    engineer    35444

      name  age          occ  salary
id
1    Vinay   22    engineer    45000
2     Ajay   24      doctor    40000
3    Rohan   25  accountant    35000
4   Dhiraj   21      manager   52000
5      Ram   20      doctor    65000
6    Sumit   25    engineer    41000
7   Keshav   24    engineer    23000
8   Kartik   23     mechanic   45111
9    Aryan   23      manager   21000
10    Amar   22    engineer    35444

In [44]:
#Sorting a Dataframe by Index
print(dataframe) # original unsorted dataframe with custom indexing (id)

print()

dataframe_sorted = dataframe.sort_index()

print(dataframe_sorted)

   id    name  age          occ  salary
0   1   Vinay   22    engineer    45000
1   2    Ajay   24      doctor    40000
2   3   Rohan   25  accountant    35000
3   4  Dhiraj   21      manager   52000
4   5     Ram   20      doctor    65000
5   6   Sumit   25    engineer    41000
6   7  Keshav   24    engineer    23000
7   8  Kartik   23     mechanic   45111
8   9   Aryan   23      manager   21000
9  10    Amar   22    engineer    35444

   id    name  age          occ  salary
0   1   Vinay   22    engineer    45000
1   2    Ajay   24      doctor    40000
2   3   Rohan   25  accountant    35000
3   4  Dhiraj   21      manager   52000
4   5     Ram   20      doctor    65000
5   6   Sumit   25    engineer    41000
6   7  Keshav   24    engineer    23000
7   8  Kartik   23     mechanic   45111
8   9   Aryan   23      manager   21000
9  10    Amar   22    engineer    35444

In [45]:
#Sorting a Dataframe by Multiple Columns
print(dataframe) # original dataframe

print()

dataframe_sorted = dataframe.sort_values(by = ['id', 'age']) # dataframe after sorting by 'id' and 'age'

print(dataframe_sorted)

   id    name  age          occ  salary
0   1   Vinay   22    engineer    45000
1   2    Ajay   24      doctor    40000
2   3   Rohan   25  accountant    35000
3   4  Dhiraj   21      manager   52000
4   5     Ram   20      doctor    65000
5   6   Sumit   25    engineer    41000
6   7  Keshav   24    engineer    23000
7   8  Kartik   23     mechanic   45111
8   9   Aryan   23      manager   21000
9  10    Amar   22    engineer    35444

   id    name  age          occ  salary
0   1   Vinay   22    engineer    45000
1   2    Ajay   24      doctor    40000
2   3   Rohan   25  accountant    35000
3   4  Dhiraj   21      manager   52000
4   5     Ram   20      doctor    65000
5   6   Sumit   25    engineer    41000
6   7  Keshav   24    engineer    23000
7   8  Kartik   23     mechanic   45111
8   9   Aryan   23      manager   21000
9  10    Amar   22    engineer    35444

In [46]:
#DataFrame with Custom Index to DataFrame with Dataframe with default indexes
print(dataframe_customindex) # printing the original dataframe with custom indexing

print()

dataframe = dataframe_customindex.reset_index()

print(dataframe) # printing the dataframe with default indexes

      name  age          occ  salary
id
1    Vinay   22    engineer    45000
2     Ajay   24      doctor    40000
3    Rohan   25  accountant    35000
4   Dhiraj   21      manager   52000
5      Ram   20      doctor    65000
6    Sumit   25    engineer    41000
7   Keshav   24    engineer    23000
8   Kartik   23     mechanic   45111
9    Aryan   23      manager   21000
10    Amar   22    engineer    35444

   id    name  age          occ  salary
0   1   Vinay   22    engineer    45000
1   2    Ajay   24      doctor    40000
2   3   Rohan   25  accountant    35000
3   4  Dhiraj   21      manager   52000
4   5     Ram   20      doctor    65000
5   6   Sumit   25    engineer    41000
6   7  Keshav   24    engineer    23000
7   8  Kartik   23     mechanic   45111
8   9   Aryan   23      manager   21000
9  10    Amar   22    engineer    35444

In [47]:
#Indexing and Selecting Columns in a DataFrame
print(dataframe) # original dataframe

print()

o = dataframe['name'] # extracting the column 'name'

print(o)

   id    name  age          occ  salary
0   1   Vinay   22    engineer    45000
1   2    Ajay   24      doctor    40000
2   3   Rohan   25  accountant    35000
3   4  Dhiraj   21      manager   52000
4   5     Ram   20      doctor    65000
5   6   Sumit   25    engineer    41000
6   7  Keshav   24    engineer    23000
7   8  Kartik   23     mechanic   45111
8   9   Aryan   23      manager   21000
9  10    Amar   22    engineer    35444

0     Vinay
1      Ajay
2     Rohan
3    Dhiraj
4       Ram
5     Sumit
6    Keshav
7    Kartik
8     Aryan
9      Amar
Name: name, dtype: object

In [48]:
#Indexing and Selecting Rows in a DataFrame
print(dataframe) # original dataframe

print()

o = dataframe.iloc[[0,1], :] # extracting the 1st 2 rows of the dataframe

print(o)

   id    name  age          occ  salary
0   1   Vinay   22    engineer    45000
1   2    Ajay   24      doctor    40000
2   3   Rohan   25  accountant    35000
3   4  Dhiraj   21      manager   52000
4   5     Ram   20      doctor    65000
5   6   Sumit   25    engineer    41000
6   7  Keshav   24    engineer    23000
7   8  Kartik   23     mechanic   45111
8   9   Aryan   23      manager   21000
9  10    Amar   22    engineer    35444

   id   name  age        occ  salary
0   1  Vinay   22  engineer    45000
1   2   Ajay   24    doctor    40000

In [49]:
#Conditional Selection of Rows in a DataFrame
print(dataframe) # original dataframe

print()

# selecting people with age greater than or equal to 24

dataframe_condition = dataframe.loc[dataframe.age >= 24]

print(dataframe_condition)

   id    name  age          occ  salary
0   1   Vinay   22    engineer    45000
1   2    Ajay   24      doctor    40000
2   3   Rohan   25  accountant    35000
3   4  Dhiraj   21      manager   52000
4   5     Ram   20      doctor    65000
5   6   Sumit   25    engineer    41000
6   7  Keshav   24    engineer    23000
7   8  Kartik   23     mechanic   45111
8   9   Aryan   23      manager   21000
9  10    Amar   22    engineer    35444

   id    name  age          occ  salary
1   2    Ajay   24      doctor    40000
2   3   Rohan   25  accountant    35000
5   6   Sumit   25    engineer    41000
6   7  Keshav   24    engineer    23000

In [50]:
#Applying Aggregate Functions
print(dataframe) # original dataframe

print()

occ_average_age = dataframe.groupby('occ')['salary'].mean() # required dataframe

print(occ_average_age)

   id    name  age          occ  salary
0   1   Vinay   22    engineer    45000
1   2    Ajay   24      doctor    40000
2   3   Rohan   25  accountant    35000
3   4  Dhiraj   21      manager   52000
4   5     Ram   20      doctor    65000
5   6   Sumit   25    engineer    41000
6   7  Keshav   24    engineer    23000
7   8  Kartik   23     mechanic   45111
8   9   Aryan   23      manager   21000
9  10    Amar   22    engineer    35444

occ
accountant     35000.0
doctor         52500.0
engineer       36111.0
manager        36500.0
mechanic       45111.0
Name: salary, dtype: float64

In [51]:
#Filling NaN Values in a DataFrame
print(dataframe) # original dataframe

print()

dataframe_nullfill = dataframe.fillna(0)

print(dataframe_nullfill) # dataframe after filling NaN values with 1

   id    name  age          occ  salary
0   1   Vinay   22    engineer    45000
1   2    Ajay   24      doctor    40000
2   3   Rohan   25  accountant    35000
3   4  Dhiraj   21      manager   52000
4   5     Ram   20      doctor    65000
5   6   Sumit   25    engineer    41000
6   7  Keshav   24    engineer    23000
7   8  Kartik   23     mechanic   45111
8   9   Aryan   23      manager   21000
9  10    Amar   22    engineer    35444

   id    name  age          occ  salary
0   1   Vinay   22    engineer    45000
1   2    Ajay   24      doctor    40000
2   3   Rohan   25  accountant    35000
3   4  Dhiraj   21      manager   52000
4   5     Ram   20      doctor    65000
5   6   Sumit   25    engineer    41000
6   7  Keshav   24    engineer    23000
7   8  Kartik   23     mechanic   45111
8   9   Aryan   23      manager   21000
9  10    Amar   22    engineer    35444

In [52]:
#Applying Functions (UDFs) on DataFrame
company_data = pd.read_csv('data_company.csv')
print(company_data) # original dataframe

print()

company_data['profit'] = company_data['profit'].apply(lambda x:x>0)

print(company_data) # required dataframe

               cname  profit  eid         position
0    taskaro and co.   10000    1         employee
1  healty pipes lim.   -4000    2         employee
2  honey and rappers   29000    3           intern
3    prawn fisheries  150000    4  senior_employee

               cname  profit  eid         position
0    taskaro and co.    True    1         employee
1  healty pipes lim.   False    2         employee
2  honey and rappers    True    3           intern
3    prawn fisheries    True    4  senior_employee

In [53]:
#Joining 2 DataFrames by a Common Column (key)
emp_data = pd.read_csv('data_emp.csv')
print(emp_data) # 1st DataFrame containing employee id (eid), employee name (ename) and stipend

print()

print(company_data) # 2nd DataFrame containing employee id (eid) and designation of the employee (position)

print()

dataframe = pd.merge(emp_data, company_data, how = 'inner', on = 'eid') # required dataframe

print(dataframe)

   eid   ename  stipend
0    1     Sid    15000
1    2  Rajesh    12000
2    3    Kams    32000
3    4   Zehab    12000

               cname  profit  eid         position
0    taskaro and co.    True    1         employee
1  healty pipes lim.   False    2         employee
2  honey and rappers    True    3           intern
3    prawn fisheries    True    4  senior_employee

   eid   ename  stipend              cname  profit         position
0    1     Sid    15000    taskaro and co.    True         employee
1    2  Rajesh    12000  healty pipes lim.   False         employee
2    3    Kams    32000  honey and rappers    True           intern
3    4   Zehab    12000    prawn fisheries    True  senior_employee

In [54]:
#Getting the Non-Null Count and Data Type for Every Column
print(dataframe) # the dataframe

print()

print(dataframe.info())

   eid   ename  stipend              cname  profit         position
0    1     Sid    15000    taskaro and co.    True         employee
1    2  Rajesh    12000  healty pipes lim.   False         employee
2    3    Kams    32000  honey and rappers    True           intern
3    4   Zehab    12000    prawn fisheries    True  senior_employee

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4 entries, 0 to 3
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   eid       4 non-null      int64
 1   ename     4 non-null      object
 2   stipend   4 non-null      int64
 3   cname     4 non-null      object
 4   profit    4 non-null      bool
 5   position  4 non-null      object
dtypes: bool(1), int64(2), object(3)
memory usage: 196.0+ bytes
None

In [55]:
#Getting the Statistical Summary of all the Numerical Features of a DataFrame
print(dataframe) # the dataframe

print()

print(dataframe.describe())

   eid   ename  stipend              cname  profit         position
0    1     Sid    15000    taskaro and co.    True         employee
1    2  Rajesh    12000  healty pipes lim.   False         employee
2    3    Kams    32000  honey and rappers    True           intern
3    4   Zehab    12000    prawn fisheries    True  senior_employee

            eid       stipend
count  4.000000      4.000000
mean   2.500000  17750.000000
std    1.290994   9604.686356
min    1.000000  12000.000000
25%    1.750000  12000.000000
50%    2.500000  13500.000000
75%    3.250000  19250.000000
max    4.000000  32000.000000

In [56]:
#Link 3
import numpy as np  # optional
import pandas as pd
print(pd.__version__)
print(pd.show_versions(as_json=True))

1.5.2
{
  "system": {
    "commit": "8dab54d6573f7186ff0c3b6364d5e4dd635ff3e7",
    "python": "3.11.0.final.0",
    "python-bits": 64,
    "OS": "Windows",
    "OS-release": "10",
    "Version": "10.0.22621",
    "machine": "AMD64",
    "processor": "AMD64 Family 23 Model 24 Stepping 1, AuthenticAMD",
    "byteorder": "little",
    "LC_ALL": null,
    "LANG": null,
    "LOCALE": {
      "language-code": "English_India",
      "encoding": "1252"
    }
  },
  "dependencies": {
    "pandas": "1.5.2",
    "numpy": "1.24.1",
    "pytz": "2022.7.1",
    "dateutil": "2.8.2",
    "setuptools": "65.5.0",
    "pip": "22.3.1",
    "Cython": null,
    "pytest": null,
    "hypothesis": null,
    "sphinx": null,
    "blosc": null,
    "feather": null,
    "xlsxwriter": null,
    "lxml.etree": null,
    "html5lib": null,
    "pymysql": null,
    "psycopg2": null,
    "jinja2": "3.1.2",
    "IPython": "8.8.0",
    "pandas_datareader": null,
    "bs4": "4.11.1",
    "bottleneck": null,
    "brotli": null,
    "fastparquet": null,
    "fsspec": null,
    "gcsfs": null,
    "matplotlib": null,
    "numba": null,
    "numexpr": null,
    "odfpy": null,
    "openpyxl": null,
    "pandas_gbq": null,
    "pyarrow": null,
    "pyreadstat": null,
    "pyxlsb": null,
    "s3fs": null,
    "scipy": null,
    "snappy": null,
    "sqlalchemy": null,
    "tables": null,
    "tabulate": null,
    "xarray": null,
    "xlrd": null,
    "xlwt": null,
    "zstandard": null,
    "tzdata": null
  }
}None

C:\Python311\Lib\site-packages\_distutils_hack\__init__.py:33: UserWarning: Setuptools is replacing distutils.
  warnings.warn("Setuptools is replacing distutils.")

In [57]:
import numpy as np
mylist = list('abcedfghijklmnopqrstuvwxyz')
myarr = np.arange(26)
mydict = dict(zip(mylist, myarr))

In [58]:
ser1 = pd.Series(mylist)
ser2 = pd.Series(myarr)
ser3 = pd.Series(mydict)
print(ser3.head())

a    0
b    1
c    2
e    3
d    4
dtype: int32

In [59]:
mylist = list('abcedfghijklmnopqrstuvwxyz')
myarr = np.arange(26)
mydict = dict(zip(mylist, myarr))
ser = pd.Series(mydict)

In [60]:
df = ser.to_frame().reset_index()
print(df.head())

  index  0
0     a  0
1     b  1
2     c  2
3     e  3
4     d  4

In [61]:
import numpy as np
ser1 = pd.Series(list('abcedfghijklmnopqrstuvwxyz'))
ser2 = pd.Series(np.arange(26))

In [62]:
df = pd.concat([ser1, ser2], axis=1)
df = pd.DataFrame({'col1': ser1, 'col2': ser2})
print(df.head())

  col1  col2
0    a     0
1    b     1
2    c     2
3    e     3
4    d     4

In [63]:
# Input
ser = pd.Series(list('abcedfghijklmnopqrstuvwxyz'))

# Solution
ser.name = 'alphabets'
ser.head()

0    a
1    b
2    c
3    e
4    d
Name: alphabets, dtype: object

In [64]:
# Input
ser1 = pd.Series([1, 2, 3, 4, 5])
ser2 = pd.Series([4, 5, 6, 7, 8])

# Solution
ser1[~ser1.isin(ser2)]

0    1
1    2
2    3
dtype: int64

In [65]:
# Input
ser1 = pd.Series([1, 2, 3, 4, 5])
ser2 = pd.Series([4, 5, 6, 7, 8])

# Solution
ser_u = pd.Series(np.union1d(ser1, ser2))  # union
ser_i = pd.Series(np.intersect1d(ser1, ser2))  # intersect
ser_u[~ser_u.isin(ser_i)]

0    1
1    2
2    3
5    6
6    7
7    8
dtype: int64

In [66]:
# Input
state = np.random.RandomState(100)
ser = pd.Series(state.normal(10, 5, 25))

# Solution
np.percentile(ser, q=[0, 25, 50, 75, 100])

array([ 1.25117263,  7.70986507, 10.92259345, 13.36360403, 18.0949083 ])

In [67]:
# Input
ser = pd.Series(np.take(list('abcdefgh'), np.random.randint(8, size=30)))

# Solution
ser.value_counts()

h    8
d    7
c    6
g    5
e    3
b    1
dtype: int64

In [68]:
# Input
np.random.RandomState(100)
ser = pd.Series(np.random.randint(1, 5, [12]))

# Solution
print("Top 2 Freq:", ser.value_counts())
ser[~ser.isin(ser.value_counts().index[:2])] = 'Other'
ser

RandomState(MT19937) at 0x15C796AB040

Top 2 Freq: 2    4
1    3
3    3
4    2
dtype: int64

0         1
1     Other
2     Other
3     Other
4         2
5         2
6         2
7         1
8         1
9     Other
10    Other
11        2
dtype: object

In [69]:
# Input
ser = pd.Series(np.random.random(20))
print(ser.head())

# Solution
pd.qcut(ser, q=[0, .10, .20, .3, .4, .5, .6, .7, .8, .9, 1], 
        labels=['1st', '2nd', '3rd', '4th', '5th', '6th', '7th', '8th', '9th', '10th']).head()

0    0.861494
1    0.620202
2    0.848411
3    0.584573
4    0.252905
dtype: float64

0    9th
1    6th
2    9th
3    4th
4    2nd
dtype: category
Categories (10, object): ['1st' < '2nd' < '3rd' < '4th' ... '7th' < '8th' < '9th' < '10th']

In [70]:
# Input
ser = pd.Series(np.random.randint(1, 10, 35))

# Solution
df = pd.DataFrame(ser.values.reshape(7,5))
print(df)

   0  1  2  3  4
0  6  6  2  7  7
1  8  2  7  9  3
2  9  3  9  8  6
3  5  1  3  3  3
4  4  1  1  8  2
5  4  8  6  2  4
6  4  1  6  3  9

In [71]:
# Input
ser = pd.Series(np.random.randint(1, 10, 7))
ser

# Solution
print(ser)
np.argwhere(ser % 3==0)

0    7
1    6
2    8
3    3
4    5
5    8
6    2
dtype: int32

0    7
1    6
2    8
3    3
4    5
5    8
6    2
dtype: int32

ValueError: Length of values (1) does not match length of index (7)

In [72]:
# Input
ser = pd.Series(list('abcdefghijklmnopqrstuvwxyz'))
pos = [0, 4, 8, 14, 20]

# Solution
ser.take(pos)

0     a
4     e
8     i
14    o
20    u
dtype: object

In [73]:
# Input
ser1 = pd.Series(range(5))
ser2 = pd.Series(list('abcde'))

# Output
# Vertical
ser1.append(ser2)

# Horizontal
df = pd.concat([ser1, ser2], axis=1)
print(df)

C:\Users\anant\AppData\Local\Temp\ipykernel_13612\1555075764.py:7: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  ser1.append(ser2)

0    0
1    1
2    2
3    3
4    4
0    a
1    b
2    c
3    d
4    e
dtype: object

   0  1
0  0  a
1  1  b
2  2  c
3  3  d
4  4  e

In [74]:
# Input
ser1 = pd.Series([10, 9, 6, 5, 3, 1, 12, 8, 13])
ser2 = pd.Series([1, 3, 10, 13])

# Solution 1
[np.where(i == ser1)[0].tolist()[0] for i in ser2]

# Solution 2
[pd.Index(ser1).get_loc(i) for i in ser2]

[5, 4, 0, 8]

[5, 4, 0, 8]

In [75]:
# Input
truth = pd.Series(range(10))
pred = pd.Series(range(10)) + np.random.random(10)

# Solution
np.mean((truth-pred)**2)

0.3389198551502678

In [76]:
# Input
ser = pd.Series(['how', 'to', 'kick', 'ass?'])

# Solution 1
ser.map(lambda x: x.title())

# Solution 2
ser.map(lambda x: x[0].upper() + x[1:])

# Solution 3
pd.Series([i.title() for i in ser])

0     How
1      To
2    Kick
3    Ass?
dtype: object

0     How
1      To
2    Kick
3    Ass?
dtype: object

0     How
1      To
2    Kick
3    Ass?
dtype: object

In [77]:
# Input
ser = pd.Series(['how', 'to', 'kick', 'ass?'])

# Solution
ser.map(lambda x: len(x))

0    3
1    2
2    4
3    4
dtype: int64

In [78]:
# Input
ser = pd.Series([1, 3, 6, 10, 15, 21, 27, 35])

# Solution
print(ser.diff().tolist())
print(ser.diff().diff().tolist())

[nan, 2.0, 3.0, 4.0, 5.0, 6.0, 6.0, 8.0]
[nan, nan, 1.0, 1.0, 1.0, 1.0, 0.0, 2.0]

In [79]:
# Input
ser = pd.Series(['01 Jan 2010', '02-02-2011', '20120303', '2013/04/04', '2014-05-05', '2015-06-06T12:20'])

# Solution 1
from dateutil.parser import parse
ser.map(lambda x: parse(x))

# Solution 2
pd.to_datetime(ser)

0   2010-01-01 00:00:00
1   2011-02-02 00:00:00
2   2012-03-03 00:00:00
3   2013-04-04 00:00:00
4   2014-05-05 00:00:00
5   2015-06-06 12:20:00
dtype: datetime64[ns]

0   2010-01-01 00:00:00
1   2011-02-02 00:00:00
2   2012-03-03 00:00:00
3   2013-04-04 00:00:00
4   2014-05-05 00:00:00
5   2015-06-06 12:20:00
dtype: datetime64[ns]

In [80]:
# Input
ser = pd.Series(['01 Jan 2010', '02-02-2011', '20120303', '2013/04/04', '2014-05-05', '2015-06-06T12:20'])

# Solution
from dateutil.parser import parse
ser_ts = ser.map(lambda x: parse(x))

# day of month
print("Date: ", ser_ts.dt.day.tolist())

# week number
print("Week number: ", ser_ts.dt.weekofyear.tolist())

# day of year
print("Day number of year: ", ser_ts.dt.dayofyear.tolist())

# day of week
print("Day of week: ", ser_ts.dt.weekday_name.tolist())

Date:  [1, 2, 3, 4, 5, 6]
Week number:  [53, 5, 9, 14, 19, 23]
Day number of year:  [1, 33, 63, 94, 125, 157]

C:\Users\anant\AppData\Local\Temp\ipykernel_13612\3560197171.py:12: FutureWarning: Series.dt.weekofyear and Series.dt.week have been deprecated. Please use Series.dt.isocalendar().week instead.
  print("Week number: ", ser_ts.dt.weekofyear.tolist())

AttributeError: 'DatetimeProperties' object has no attribute 'weekday_name'

In [81]:
# Input
ser = pd.Series(['Apple', 'Orange', 'Plan', 'Python', 'Money'])

# Solution
from collections import Counter
mask = ser.map(lambda x: sum([Counter(x.lower()).get(i, 0) for i in list('aeiou')]) >= 2)
ser[mask]

0     Apple
1    Orange
4     Money
dtype: object

In [82]:
# Input
emails = pd.Series(['buying books at amazom.com', 'rameses@egypt.com', 'matt@t.co', 'narendra@modi.com'])

# Solution 1 (as series of strings)
import re
pattern ='[A-Za-z0-9._%+-]+@[A-Za-z0-9.-]+\\.[A-Za-z]{2,4}'
mask = emails.map(lambda x: bool(re.match(pattern, x)))
emails[mask]

# Solution 2 (as series of list)
emails.str.findall(pattern, flags=re.IGNORECASE)

# Solution 3 (as list)
[x[0] for x in [re.findall(pattern, email) for email in emails] if len(x) > 0]

1    rameses@egypt.com
2            matt@t.co
3    narendra@modi.com
dtype: object

0                     []
1    [rameses@egypt.com]
2            [matt@t.co]
3    [narendra@modi.com]
dtype: object

['rameses@egypt.com', 'matt@t.co', 'narendra@modi.com']

In [83]:
# Input
fruit = pd.Series(np.random.choice(['apple', 'banana', 'carrot'], 10))
weights = pd.Series(np.linspace(1, 10, 10))

# Solution
weights.groupby(fruit).mean()

apple     5.428571
banana    8.000000
carrot    4.500000
dtype: float64

In [84]:
# Input
p = pd.Series([1, 2, 3, 4, 5, 6, 7, 8, 9, 10])
q = pd.Series([10, 9, 8, 7, 6, 5, 4, 3, 2, 1])

# Solution 
sum((p - q)**2)**.5

# Solution (using func)
np.linalg.norm(p-q)

18.16590212458495

18.16590212458495

In [85]:
# Input
ser = pd.Series([2, 10, 3, 4, 9, 10, 2, 7, 3])

# Solution
dd = np.diff(np.sign(np.diff(ser)))
peak_locs = np.where(dd == -2)[0] + 1
peak_locs

array([1, 5, 7], dtype=int64)

In [86]:
# Input
my_str = 'dbc deb abed gade'

# Solution
ser = pd.Series(list('dbc deb abed gade'))
freq = ser.value_counts()
print(freq)
least_freq = freq.dropna().index[-1]
"".join(ser.replace(' ', least_freq))

d    4
b    3
     3
e    3
a    2
c    1
g    1
dtype: int64

'dbcgdebgabedggade'

In [87]:
# Solution
ser = pd.Series(np.random.randint(1,10,10), pd.date_range('2000-01-01', periods=10, freq='W-SAT'))
ser

2000-01-01    8
2000-01-08    1
2000-01-15    4
2000-01-22    5
2000-01-29    7
2000-02-05    2
2000-02-12    1
2000-02-19    5
2000-02-26    2
2000-03-04    4
Freq: W-SAT, dtype: int32

In [88]:
# Input
ser = pd.Series([1,10,3, np.nan], index=pd.to_datetime(['2000-01-01', '2000-01-03', '2000-01-06', '2000-01-08']))

# Solution
ser.resample('D').ffill()  # fill with previous value

# Alternatives
ser.resample('D').bfill()  # fill with next value
ser.resample('D').bfill().ffill()  # fill next else prev value

2000-01-01     1.0
2000-01-02     1.0
2000-01-03    10.0
2000-01-04    10.0
2000-01-05    10.0
2000-01-06     3.0
2000-01-07     3.0
2000-01-08     NaN
Freq: D, dtype: float64

2000-01-01     1.0
2000-01-02    10.0
2000-01-03    10.0
2000-01-04     3.0
2000-01-05     3.0
2000-01-06     3.0
2000-01-07     NaN
2000-01-08     NaN
Freq: D, dtype: float64

2000-01-01     1.0
2000-01-02    10.0
2000-01-03    10.0
2000-01-04     3.0
2000-01-05     3.0
2000-01-06     3.0
2000-01-07     3.0
2000-01-08     3.0
Freq: D, dtype: float64

In [89]:
# Input
ser = pd.Series(np.arange(20) + np.random.normal(1, 10, 20))

# Solution
autocorrelations = [ser.autocorr(i).round(2) for i in range(11)]
print(autocorrelations[1:])
print('Lag having highest correlation: ', np.argmax(np.abs(autocorrelations[1:]))+1)

[0.23, 0.22, 0.24, 0.54, -0.13, 0.24, 0.32, -0.0, -0.03, 0.11]
Lag having highest correlation:  4

In [1]:
# Solution 1: Use chunks and for-loop
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/BostonHousing.csv', chunksize=50)
df2 = pd.DataFrame()
for chunk in df:
    df2 = df2.append(chunk.iloc[0,:])


# Solution 2: Use chunks and list comprehension
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/BostonHousing.csv', chunksize=50)
df2 = pd.concat([chunk.iloc[0] for chunk in df], axis=1)
df2 = df2.transpose()

# Solution 3: Use csv reader
import csv with open('BostonHousing.csv', 'r') as f:
    reader = csv.reader(f)
    out = []
    for i, row in enumerate(reader):
        if i%50 == 0:
            out.append(row)

df2 = pd.DataFrame(out[1:], columns=out[0])
print(df2.head())

SyntaxError: invalid syntax (1470508791.py, line 14)